Revit 2027 API
FamilyTypeSet.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	FamilyType item
)
Public Overridable Function Insert (
	item As FamilyType
) As Boolean
public:
virtual bool Insert(
	FamilyType^ item
)
abstract Insert :
        item : FamilyType -> bool
override Insert :
        item : FamilyType -> bool
Parameters
item FamilyType
Return Value
Boolean
See Also
Reference
FamilyTypeSet Class
Autodesk.Revit.DB Namespace